import React from 'react'
import Header from '../../components/Header/Header'
import Footer from '../../components/Footer/Footer'

const ProjectTeam = () => {
    return (
        <div>
            <Header />
            <h1 className='text-2xl font-medium mb-4 p-6 max-w-7xl mx-auto'>
                Алдағы жобалар мен іс-шаралар
            </h1>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                Оқу жылы: Қазан 2025 – Маусым 2026
                «Birlik Qazaq Studentteri» ұйымы алдағы оқу жылында қазақ студенттерінің білім мен мәдениет кеңістігінде дамуына бағытталған ауқымды жобалар мен іс-шаралар өткізуді жоспарлап отыр.
            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                1. Birlik Welcome Day
                <br />
                Формат: Офлайн
                <br />
                Өткізілу мерзімі: Қазан 2025
                <br />
                Сипаттама:
                Жаңа келген студенттерге арналып ұйымдастырылатын бұл шара Түркиядағы студенттік өмірмен, оқу жүйесінің ерекшеліктерімен, заңдық құқықтармен және бейімделу мәселелерімен таныстырады. Қатысушылар тәжірибелі студенттермен танысып, пайдалы кеңестер мен ақпараттар алады.
            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                2.Республика күнін атап өту

                <br />
                Формат: Онлайн форматта видео челлендж/Офлайн мерекелік іс-шара

                <br />
                Мерзімі: Қазан 2026

                <br />
                Сипаттама:
                25 қазан – Республика күніне орай ұйымдастырылатын бұл іс-шара қазақ жастарына тарихи сана мен патриоттық рухты сіңіруге бағытталады. Бағдарлама аясында мәдени концерт, ұлттық тағамдар көрмесі, интеллектуалдық ойындар мен бейнероликтер көрсетілімі жоспарланады.

            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                3.«Birlik Arbella Cup 2025» – Футбол чемпионаты

                <br />
                Формат: Офлайн

                <br />
                Өткізілу мерзімі: Қазан – Қараша 2025

                <br />
                Сипаттама:
                Түркияның әр қаласынан қатысатын қазақ студенттерінің футбол командалары арасында өтетін тартысты дода. Финал бір қалада (мысалы, Измирде) ұйымдастырылып, спорт пен достықты ұштастырады.
            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                4.«BirlikVision 2025» – Қысқаметражды фильмдер байқауы


                <br />
                Формат: Онлайн / Офлайн финал


                <br />
                Өткізілу мерзімі: Қараша – Желтоқсан 2025


                <br />
                Сипаттама:
                Түркияның әр қаласындағы студенттер командалар құрып, қысқаметражды бейнежобалар дайындайды. Жеңімпаз туындылар тікелей эфирде көрсетіліп, онлайн дауыс беру және марапаттау рәсімі ұйымдастырылады. Бұл — шығармашыл жастарға өзін көрсетуге берілетін үлкен мүмкіндік.

            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                5.Стажировка бағдарламасы


                <br />
                Формат: Жеке қатысу / онлайн бағдарлау


                <br />
                Өткізілу мерзімі: Қараша

                <br />Сипаттама:
                Қазақ студенттеріне беделді компанияларда тәжірибе жинақтауға жағдай жасау. Бұл бастама арқылы студенттер кәсіби ортада алғашқы қадамдарын жасап, еңбек нарығында өз орнын табуға мүмкіндік алады.


            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                6.⁠ ⁠Онлайн-форум «Бірлік: Болашақ және магистратура мүмкіндіктері»

                <br />
                Формат: Онлайн
                <br />
                Өткізілу мерзімі: Қаңтар 2026

                <br />
                Сипаттама:
                Бұл форумда «Болашақ» бағдарламасы, ITB және өзге де гранттық құрылым өкілдері магистратураға түсу шарттары, мансаптық даму жолдары және шетелдегі студенттерге көрсетілетін қолдау туралы ақпаратпен бөліседі.

            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                7.⁠ ⁠«Qazaq Youth Talks» – Онлайн дебат турнирі

                <br />
                Формат: Онлайн / Финал — офлайн

                <br />
                Өткізілу мерзімі: Ақпан 2026

                <br />
                Сипаттама:
                Қазақ, орыс және ағылшын тілдерінде өтетін бұл пікірсайыс турнирінде студенттер өз ойларын ашық жеткізіп, пікір алмасады. Жеңімпаздар бірнеше кезеңнен өтіп, ақтық сайыста жүздеседі. Турнир жастардың сыни ойлауын дамытуға бағытталған.

            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                8.“Бірлік бауырсақ Party”— Ұлттық дәм мен достықтың мерекесі


                <br />
                Формат: Офлайн

                <br />
                Өткізілу мерзімі: Сәуір 2026

                <br />
                Сипаттама:
                Бұл жоба — дәстүр мен заманауилықты үйлестіре отырып, шетелдегі қазақ жастарының ұлттық тамырға деген құрметін оятуға бағытталған.
                Бауырсақ арқылы бірлік — дәм мен достықтың тоғысы екенің дәлелдеу.

            </h3>

            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                9.Ауызашар кеші


                <br />
                Формат: Офлайн


                <br />
                Мерзімі: Рамазан айы (Наурыз–Сәуір 2027)


                <br />
                Сипаттама: Түркияның белгілі қалаларында қазақ жастары үшін ортақ ифтар кештері ұйымдастырылады.

            </h3>

            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                10.Рамазан айындағы қайырымдылық іс
                <br />
                Формат: Офлайн


                <br />
                Мерзімі: Наурыз–Сәуір 2027

                <br />
                Сипаттама:
                Түркияның әр қаласында бекітілетін жоба бойынша көрсетілетін көмек. Бұл жәрмеңке форматында да болуы мүмкін. Әр қала белсенді түрде қатысып,келесі қалаға эстафета арқылы жібереді.Бұл — рухани байланыс пен әлеуметтік жауапкершілікті арттырудың маңызды үлгісі.

            </h3>

            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                11.⁠ ⁠«Birlik Panelsan Cup 2026» – Волейбол турнирі

                <br />
                Формат: Офлайн


                <br />
                Өткізілу мерзімі: Сәуір 2026


                <br />
                Сипаттама:
                Қазақ студенттері арасында өтетін спорттық турнир — тек жарыс емес, достық пен ынтымақтың да символы. Қалалар бойынша құрылатын командалар волейбол алаңында бақ сынасып, шара мәдени-танымдық кездесулермен жалғасады.

            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                12.«Бірлік Наурыз»

                <br />
                Формат: аралас формат

                <br />
                Мерзімі: Наурыз 2026

                <br />
                Сипаттама:
                Ұлыстың ұлы күнін ерекше атап өтуді мақсат еткен бұл жоба жаңа форматта, заманауи және ұлттық элементтерді үйлестіре отырып өткізіледі. Интерактивті қойылымдар, сәндік көрмелер, шеберлік сыныптары мен жастар фестивалі ұйымдастырылып, Наурыз тек дәстүрлі мереке емес, жастардың креативті алаңына айналады.

            </h3>
            <h3 className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                13.«Birlik Kibar» – интеллектуалдық ойын

                <br />
                Формат: Онлайн іріктеу / офлайн финал

                <br />
                Мерзімі: Сәуір–Мамыр 2027

                <br />
                Сипаттама:
                Түрлі тақырыптағы сұрақтарды қамтитын зияткерлік сайыс. Қатысушылар қазақ тілі, тарихы, мәдениеті, жалпы эрудиция бойынша білімдерін сынап, логикалық ойлау мен топтық жұмыс дағдыларын дамытады. Финалдық кезең арнайы бір қалада офлайн форматта өтеді.
            </h3>

            <p className='text-lg font-medium mb-4 p-6 max-w-7xl mx-auto'>
                📌 Барлық жобалар жастардың белсенділігін арттыруға, білімін тереңдетуге және ұлттық бірегейлікті сақтауға бағытталған. Қатысу — сіздің дамуыңызға жасалған сенімді қадам!
            </p>


            <Footer />
        </div>
    )
}

export default ProjectTeam