{
    "title": "О нас",
    "subtitle": "Birlik Qazaq Jastary — это волонтёрская организация, созданная с целью поддержки казахских студентов, обучающихся в Турции.",
    "desc": "Мы стремимся помочь студентам адаптироваться в новой среде, решить возникающие проблемы и предоставить возможности для личностного роста и профессионального развития. Наша организация основана на принципах взаимопомощи, единства и уважения к казахской культуре. Мы понимаем, насколько важно иметь поддержку в чужой стране, особенно для студентов, которые сталкиваются с трудностями адаптации, языковыми барьерами и другими вызовами. Мы создаём сообщество, в котором каждый студент чувствует себя в безопасности и может развиваться.",
    "help": {
        "title1": "Поддержка студентов",
        "desc2": "Мы помогаем с решением бытовых и юридических вопросов, предоставляем консультации по учебным и административным процессам в турецких университетах, организуем помощь с жильём и интеграцией в новую среду.",
        "title2": "Образовательные инициативы",
        "desc3": "Мы проводим тренинги, мастер-классы и лекции, направленные на развитие личных и профессиональных навыков студентов. Мы уверены, что знания и опыт — это ключ к успеху.",
        "title3": "Культурные мероприятия",
        "desc4": "Мы организуем культурные события, где студенты могут познакомиться с традициями и культурой Казахстана, а также узнать о культуре Турции, налаживая межкультурные связи."
    },
    "mission": {
        "title": "Наша миссия",
        "desc1": "Помочь студентам адаптироваться в новой среде, решить возникающие проблемы и предоставить возможности для личностного роста и профессионального развития.",
        "desc2": "Создать крепкие связи между казахскими студентами в Турции, поддерживать их в процессе адаптации и предоставлять образовательные, культурные и социальные возможности для улучшения их жизни. Мы верим в силу единства и стремимся развивать культурные, образовательные и социальные проекты, которые помогают студентам раскрывать свой потенциал и становиться лидерами в своих областях."
    },
    "teamCards": {
        "title1": "Поддержка студентов",
        "description1": "Мы помогаем с решением бытовых и юридических вопросов, предоставляем консультации по учебным и административным процессам в турецких университетах, организуем помощь с жильём и интеграцией в новую среду.",
        "title2": "Образовательные инициативы",
        "description2": "Мы проводим тренинги, мастер-классы и лекции, направленные на развитие личных и профессиональных навыков студентов. Мы уверены, что знания и опыт — это ключ к успеху.",
        "title3": "Культурные мероприятия",
        "description3": "Мы организуем культурные события, где студенты могут познакомиться с традициями и культурой Казахстана, а также узнать о культуре Турции, налаживая межкультурные связи."
    },
    "blog": {
        "text1": "В BIRLIK мы стремимся создать сообщество, где технологии и сотрудничество соединяются, чтобы давать силу индивидам и организациям. Наша миссия — предоставить разработчикам, студентам и бизнесу инструменты, ресурсы и поддержку, необходимые для успешного развития в быстро меняющемся мире технологий сегодня.",
        "text2": "Мы стремимся создать платформу, которая заполняет пробелы в знаниях, питает инновации и поощряет непрерывное обучение.",
        "text3": "Будь вы опытным разработчиком, стремящимся оставаться на шаг впереди, студентом, изучающим новые технологии, или бизнесом, нуждающимся в передовых решениях, BIRLIK готов помочь вам добиться успеха.",
        "title1": "Поддержка студентов и менторство",
        "title2": "Образовательные инициативы и мастер-классы",
        "blog": "Посты блога"
    },
    "team": {
        "meet": "Познакомьтесь с нашими профессионалами",
        "desc": "Мы стремимся помочь студентам адаптироваться в новой среде, решить возникающие проблемы и предоставить возможности для личностного роста и профессионального развития. Наша организация основана на принципах взаимопомощи, единства и уважения к казахской культуре. Мы понимаем, насколько важно иметь поддержку в чужой стране, особенно для студентов, которые сталкиваются с трудностями адаптации, языковыми барьерами и другими вызовами. Мы создаём сообщество, в котором каждый студент чувствует себя в безопасности и может развиваться.",
        "viewall": "Посмотреть все"
    },
    "map": {
        "title": "Более 10 лет мы оказываем услуги",
        "subtitle": "Birlik Qazaq Jastary — волонтёрская организация, созданная с целью поддержки казахских студентов, обучающихся в Турции."
    }
}