
const projects = [
    {
        image: "IMG_3415.JPG",
        title: "Дәстүрлі футбол турнирінде Чанаккале қаласының жастары да белсене қатысты.",
        description: "2024 жылы Стамбул қаласында өткен қазақ жастары арасындағы дәстүрлі футбол турнирінде Чанаккале қаласының жастары да белсене қатысты. Бұл турнир — тек спорттық жарыс қана емес, шетелде білім алып жүрген қазақ студенттерінің достығын, ынтымағын нығайтатын маңызды алаңға айналды.",
        date: "2024 жылы",
    },
    {
        image: "IMG_3413.JPG",
        title: "Түркияның Памуккале қаласында Қазақстан Парламенті Мәжілісі мен Мəслихат депутаттарын сайла",
        description: "Түркияның Памуккале қаласында Қазақстан Парламенті Мәжілісі мен Мəслихат депутаттарын сайлау бойынша дауыс беру рәсімі сәтті өтті. Бұл шара шетелдегі отандастарымыздың өз елінің саяси өміріне қатысуына зор мүмкіндік берді. Сайлау процесі ұйымдастырушылық тұрғыдан жоғары деңгейде өтіп, Қазақстан азаматтарының құқықтары толық қамтамасыз етілді.",
        date: "2023 жылдың 19 наурызында",
    },
    {
        image: "IMG_3412.JPG",
        title: "Мұзбалық ақын Мұқағали Мақатаевтің шығармашылығы кешінен естелік сурет",
        description: "Hassaq Community жастары ұйымдастырған,2025 жылдың ақпан айында мұзбалық ақын Мұқағали Мақатаевтің шығармашылығына орай өткізілген “Сегізінші кереметім” атты әдеби-поэтикалық кешінен естелік сурет",
        date: "2025 жыл",
    },
    {
        image: "IMG_3411.JPG",
        title: "Волейбол турнирі өтті және де Ыспарта қаласының қыздары да қатысты",
        description: "2025 жылы 27-ші сәуірде қыздар арасында ауқымды волейбол турнирі өтті және де Ыспарта қаласының қыздары да қатысты.Бұл іс-шара шетелдегі қазақ жастарының бірлігін арттыру, салауатты өмір салтын қолдау және достық байланысты нығайту мақсатында ұйымдастырылды.",
        date: "2025 жылы 27-ші сәуірде",
    },
    {
        image: "IMG_3399.JPG",
        title: "Болу қаласында қазақ жастарының қатысуымен",
        description: "Болу қаласында қазақ жастарының қатысуымен достық пен бірлікті нығайту мақсатында көңілді пикник ұйымдастырылды. Табиғат аясында өткен бұл басқосу қатысушыларға демалып, бір-бірімен жақынырақ танысуға, ұлттық ойындар ойнап, әңгіме-дүкен құруға мүмкіндік берді.",
        date: "",
    },
    {
        image: "IMG_3397.JPG",
        title: "Тәуелсіздігіміздің 33 жылдығына орай ерекше мерекелік",
        description: "2024 жылғы 17 желтоқсанда Тәуелсіздігіміздің 33 жылдығына орай ерекше мерекелік іс-шара ұйымдастырылды. Шараға құрметті ұстаздарымыз бен арнайы қонақтар қатысып, 70-ке жуық студент жиналды",
        date: "2024 жылғы 17 желтоқсанда",
    },
    {
        image: "IMG_3396.JPG",
        title: "Афьон қаласының қазақ жастары",
        description: "2024 жылы Афьон қаласының қазақ жастары Қазақстанның мәдениеті мен дәстүрін насихаттау мақсатында Қазақстанды таныту кешін ұйымдастырды.",
        date: "2024 жылы",
    },
    {
        image: "IMG_3394.JPG",
        title: "Сакария қаласында Тәуелсіздігіміздің 32 жылдығы",
        description: "Сакария қаласында Тәуелсіздігіміздің 32 жылдығына орай ерекше маңызы бар мерекелік іс-шара ұйымдастырылды. Шара барысында қазақ халқының тарихы мен мәдениеті дәріптеліп, ұлттық әндер мен билер орындалып, қатысушыларға мерекелік көңіл-күй сыйланды.",
        date: "2023 жылғы 15 желтоқсанда",
    },
    {
        image: "IMG_3393.JPG",
        title: "Маниса Джелал Байар университеті",
        description: "2024 жылғы 27 қараша күні Маниса Джелал Байар университетінде білім алып жатқан қазақстандық студенттер үшін ерекше мәні бар кездесу өтті. Ыстанбұлдағы Қазақстан Республикасының Бас консулы Нұриддин Аманқұл мырза Маниса қаласына арнайы келіп, мұндағы қазақстандық студенттермен жүздесті.",
        date: "2024 жылғы 27 қараша",
    },
    {
        image: "t2.jpeg",
        title: "Құрылтай - 2024",
        description: `Медиполь Университеті, Ыстанбұл
Түркиядағы әртүрлі қалаларда білім алып жатқан белсенді қазақ жастары бас қосқан ерекше жиын. Бұл күні ел болашағына бейжай қарамайтын көшбасшылар бір алаңда тоғысып, бірлік пен дамудың жаңа қадамдарын белгіледі`,
        date: '25.05.2024'
    },
    {
        image: "t3.jpeg",
        title: "Ыстанбұлдағы Бас консулдықтағы кездесу",
        description: `Ыстанбұлдағы түрлі университеттердің белсенді студент-көшбасшылары Қазақстан Республикасының Бас консулдығында бас қосты.
Кездесу барысында жастар мен консулдық өкілдері бірлескен бастамалар, оқу-білім, мәдени және әлеуметтік жобалар туралы пікір алмасты.
Бұл басқосу — шетелдегі қазақ жастарының ұйымшылдығын арттырып, олардың рухани-мәдени байланысын нығайтудың маңызды қадамы болды.`,
        date: '29.09.2024'
    },
    {
        image: "t4.jpeg",
        title: "Ыстанбұл, Қазақстанның Бас консулдығы",
        description: `2024–2025 оқу жылына арналған бірлескен жобалар мен бастамалар талқыланып, Қазақ жастары мен Ыстанбұлдағы Қазақстан Республикасының Бас консулдығы өкілдері арасында жылдық іс-шаралар жоспары бекітілді.
Бұл кездесу – жастар мен дипломатиялық өкілдік арасындағы ынтымақтастықты нығайтып, алдағы жылы ұлттық рух, білім, мәдениет пен қоғам белсенділігін арттыруға бағытталған маңызды қадам болды.`,
        date: '17.07.2024'
    },
    {
        image: "t5.jpeg",
        title: "Ұлттық Домбыра Күні",
        description: `Ұлттық домбыра күніне орай, Түркияда оқып жатқан қазақ жастары жергілікті тұрғындармен бірге рухани-мәдени кеш өткізді. Кеш барысында киелі домбыраның үні шырқалып, халқымыздың бай мұрасы мен ұлттық өнері насихатталды. Бұл — бірлігімізді, түп тамырымызды еске салып, жүректерге шабыт берген ерекше күн болды.`,
        date: '07.07.2024'
    },
    {
        image: "t6.jpeg",
        title: "Birlik Medicine",
        description: `Қазақстаннан келген болашақ дәрігерлер мен Түркияда еңбек етіп жүрген тәжірибелі медицина мамандарының басқосу кеші. Бұл кездесудің мақсаты — білім мен тәжірибе алмасу, кәсіби бағытта қолдау көрсету және медициналық қауымдастық арасында тығыз байланыс орнату.`,
        date: '13.06.2024'
    },
//     {
//         image: "t7.jpeg",
//         title: "Birlik IT-клубының ашылуы",
//         description: `Түркиядағы қазақ жастары үшін маңызды сәттердің бірі — Birlik IT-клубының ресми ашылуы өтті.
// Бұл клуб – ақпараттық технологиялар саласында білім алып жүрген студенттердің басын қосып, бірлесіп даму, тәжірибе алмасу және заманауи ІТ бағыттарда жобалар жасау алаңы болмақ.
// Клубтың басты мақсаты — түрлі университеттердегі ІТ-қа қызығушылығы бар жастарды біріктіріп, олардың кәсіби өсуіне жағдай жасау.`,
//         date: '02.11.2024'
//     },
    {
        image: "t8.jpeg",
        title: "Студенттер күніне орай көшбасшылардың бас қосуы",
        description: `Студенттер күніне орай Түркияның әр қаласында білім алып жүрген қазақ студенттерінің көшбасшылары Ыстанбұлда бас қосты.
Бұл ерекше кездесудің басты мақсаты — жастар арасындағы бірлікті нығайту, жаңа жобалармен бөлісу және студенттік ұйымдар арасындағы ынтымақтастықты арттыру.Бұл басқосу — алдағы бастамаларға серпін беретін, студенттердің рухын көтерген маңызды әрі мазмұнды жиын болды.`,
        date: '17.11.2024'
    },
    {
        image: "t9.jpeg",
        title: "Республика күніне орай құттықтау",
        description: `Құрметті отандастар!
Тәуелсіз еліміздің маңызды мерекелерінің бірі — Қазақстан Республикасының күнімен шын жүректен құттықтаймыз!
Бұл — мемлекеттігіміздің нығайып, демократиялық құндылықтардың орныққанын білдіретін тарихи күн.
Шетелде білім алып жатқан қазақ жастары ретінде, біз ел болашағы үшін жауапты екенімізді сезіне отырып, туған жеріміздің дамуы мен өркендеуіне өз үлесімізді қосуға әрдайым дайынбыз.`,
        date: '25.10.2024'
    },
    {
        image: "t10.jpeg",
        title: "Ыстанбұл қаласындағы қазақ студенттері",
        description: `Түркия, Ыстанбұл қаласындағы қазақ студенттерінің қатысуымен алғашқы театр қойылымы сәтті өткізілді! Шара 16 желтоқсан – Қазақстан Республикасының Тәуелсіздік күніне арналды.
Бұл қойылым тек мәдени шара ғана емес, сонымен қатар елге деген сүйіспеншілік пен ұлт рухын паш еткен ерекше бастама болды. Студенттердің таланты мен өнерге деген ықыласы көрермендерге ерекше әсер сыйлады.`,
        date: '16.12.2024'
    },
    {
        image: "t11.jpeg",
        title: "Birlik Baursaq Party ",
        description: `Ыстанбұлда қазақ халқының дәстүрлі тағамы — бауырсақ кеңінен таныстырылды. Шара аясында университет студенттері, әсіресе қыздар қауымы арасында бауырсақ пісіруден сайыс ұйымдастырылып, ұлттық дәм мен мәдениетті дәріптейтін керемет атмосфера қалыптасты. Бұл кеш — тек дәм мен дәстүр емес, бірлікті, жылылықты сезінудің тамаша үлгісі болды.`,
        date: '08.12.2024'
    },
    {
        image: "t12.jpeg",
        title: "Наурыз – Ұлыстың ұлы күні құтты болсын!  ",
        description: `21 наурыз — жаңару мен ізгіліктің, береке мен бірліктің бастауы. Осы атаулы күнге орай қазақ жастарының атынан құттықтау жолдамасы әзірленіп, шағын анимациялық видеообзор түсірілді.

Бұл бейнеролик — ұлттық рухты, татулықты және көктем шуағын жеткізетін шағын тартуымыз.
Баршаңызға Наурыз мейрамы құтты болсын! Жаңа жыл жаңа үміт пен жақсылық әкелсін!`,
        date: '21.03.2025'
    },
    {
        image: "t13.jpeg",
        title: "Ыстанбулда – Абай Құнанбайұлының 180 жылдығына арналған рухани кеш",
        description: `Ыстанбул қаласында ұлы ойшыл, ақын және ағартушы Абай Құнанбайұлының 180 жылдық мерейтойы кең көлемде аталып өтті.

Осы атаулы күнге орай Түркиядағы қазақ жастары мен “Бірлік” Қазақ Студенттер Бірлестігі ұлы тұлғаның рухына тағзым ретінде қазақы нақыштағы шығармашылық кеш ұйымдастырды.

Кеш барысында Абайдың өлеңдері мен әндері орындалып, ұлттық рух пен мәдениетке толы ерекше атмосфера қалыптасты.
Бұл — шетелдегі жастардың Абай мұрасына деген құрметінің жарқын көрінісі болды.`,
        date: '21.03.2025'
    },
    // {
    //     image: "",
    //     title: "",
    //     description: "",
    //     date: "",
    // },
]

const ProjectCard = ({ image, title, description, date }) => {
    return (
        <div className="rounded-2xl shadow-md bg-white p-6 max-w-sm transition hover:shadow-xl">
            <img
                src={`/img/${image}`}
                alt={title}
                className="rounded-xl mb-4 object-cover w-full h-48"
            />
            <p className="text-sm text-gray-500 mb-1">
                {date}
            </p>
            <h2 className="text-2xl font-semibold text-gray-900 mb-2">
                {title}
            </h2>
            <p className="text-gray-600 mb-4">
                {description}
            </p>
        </div>
    )
}

const ProjectGrid = () => {
    return (
        <div className="container mx-auto px-4 py-8 grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-4 gap-6">
            {projects.map((project, index) => (
                <ProjectCard
                    key={index}
                    image={project.image}
                    title={project.title}
                    description={project.description}
                    date={project.date}
                />
            ))}
        </div>
    )
}

export default ProjectGrid
