import { useState } from 'react';

const Card = ({ image, title, description, date }) => {
    const [showFull, setShowFull] = useState(false);
    const toggleShow = () => setShowFull(!showFull);

    const truncated = description.length > 120 && !showFull;

    return (
        <div className="rounded-3xl bg-white shadow-sm hover:shadow-md transition-all duration-300 ease-in-out p-6 max-w-lg border border-neutral-200">
            <img
                src={`/img/${image}`}
                alt={title}
                className="rounded-2xl mb-5 object-cover w-full h-80"
            />
            <h2 className="text-[22px] font-semibold text-neutral-900 mb-2 tracking-tight">
                {title}
            </h2>
            <p className="text-[15px] text-neutral-600 mb-2 leading-relaxed">
                {truncated ? `${description.slice(0, 120)}...` : description}
            </p>

            {description.length > 120 && (
                <button
                    onClick={toggleShow}
                    className="text-sm text-blue-500 hover:underline mb-2"
                >
                    {showFull ? 'Аз көрсету' : 'Көбірек көрсету'}
                </button>
            )}

            <p className="text-sm text-neutral-400">{date}</p>
        </div>
    );
};

const CardVideo = ({ video, title, description, date }) => {
    const [showFull, setShowFull] = useState(false);
    const toggleShow = () => setShowFull(!showFull);

    const truncated = description.length > 120 && !showFull;

    return (
        <div className="rounded-3xl bg-white shadow-sm hover:shadow-md transition-all duration-300 ease-in-out p-6 border border-neutral-200">
            <video
                src={`/videos/${video}`}
                controls
                autoPlay
                muted
                loop
                className="rounded-2xl mb-5 object-cover w-full h-80"
            />
            <h2 className="text-[22px] font-semibold text-neutral-900 mb-2 tracking-tight">
                {title}
            </h2>
            <p className="text-[15px] text-neutral-600 mb-2 leading-relaxed">
                {truncated ? `${description.slice(0, 120)}...` : description}
            </p>

            {description.length > 120 && (
                <button
                    onClick={toggleShow}
                    className="text-sm text-blue-500 hover:underline mb-2"
                >
                    {showFull ? 'Аз көрсету' : 'Көбірек көрсету'}
                </button>
            )}

            <p className="text-sm text-neutral-400">{date}</p>
        </div>
    );
};

const projects = [
    {
        image: "t2.jpeg",
        title: "Құрылтай — 25.05.2024",
        description: `Медиполь Университеті, Ыстанбұл
Түркиядағы әртүрлі қалаларда білім алып жатқан белсенді қазақ жастары бас қосқан ерекше жиын. Бұл күні ел болашағына бейжай қарамайтын көшбасшылар бір алаңда тоғысып, бірлік пен дамудың жаңа қадамдарын белгіледі`,
        date: '25.05.2024'
    },
    {
        image: "t3.jpeg",
        title: "Ыстанбұлдағы Бас консулдықтағы кездесу",
        description: `Ыстанбұлдағы түрлі университеттердің белсенді студент-көшбасшылары Қазақстан Республикасының Бас консулдығында бас қосты.
Кездесу барысында жастар мен консулдық өкілдері бірлескен бастамалар, оқу-білім, мәдени және әлеуметтік жобалар туралы пікір алмасты.
Бұл басқосу — шетелдегі қазақ жастарының ұйымшылдығын арттырып, олардың рухани-мәдени байланысын нығайтудың маңызды қадамы болды.`,
        date: '29.09.2024'
    },
    {
        image: "t4.jpeg",
        title: "Ыстанбұл, Қазақстанның Бас консулдығы",
        description: `2024–2025 оқу жылына арналған бірлескен жобалар мен бастамалар талқыланып, Қазақ жастары мен Ыстанбұлдағы Қазақстан Республикасының Бас консулдығы өкілдері арасында жылдық іс-шаралар жоспары бекітілді.
Бұл кездесу – жастар мен дипломатиялық өкілдік арасындағы ынтымақтастықты нығайтып, алдағы жылы ұлттық рух, білім, мәдениет пен қоғам белсенділігін арттыруға бағытталған маңызды қадам болды.`,
        date: '17.07.2024'
    },
    {
        image: "t5.jpeg",
        title: "Ұлттық Домбыра Күні",
        description: `Ұлттық домбыра күніне орай, Түркияда оқып жатқан қазақ жастары жергілікті тұрғындармен бірге рухани-мәдени кеш өткізді. Кеш барысында киелі домбыраның үні шырқалып, халқымыздың бай мұрасы мен ұлттық өнері насихатталды. Бұл — бірлігімізді, түп тамырымызды еске салып, жүректерге шабыт берген ерекше күн болды.`,
        date: '07.07.2024'
    },
    {
        image: "t6.jpeg",
        title: "Birlik Medicine — 13.06.2024",
        description: `Қазақстаннан келген болашақ дәрігерлер мен Түркияда еңбек етіп жүрген тәжірибелі медицина мамандарының басқосу кеші. Бұл кездесудің мақсаты — білім мен тәжірибе алмасу, кәсіби бағытта қолдау көрсету және медициналық қауымдастық арасында тығыз байланыс орнату.`,
        date: '13.06.2024'
    },
    {
        image: "t7.jpeg",
        title: "Birlik IT-клубының ашылуы",
        description: `Түркиядағы қазақ жастары үшін маңызды сәттердің бірі — Birlik IT-клубының ресми ашылуы өтті.
Бұл клуб – ақпараттық технологиялар саласында білім алып жүрген студенттердің басын қосып, бірлесіп даму, тәжірибе алмасу және заманауи ІТ бағыттарда жобалар жасау алаңы болмақ.
Клубтың басты мақсаты — түрлі университеттердегі ІТ-қа қызығушылығы бар жастарды біріктіріп, олардың кәсіби өсуіне жағдай жасау.`,
        date: '02.11.2024'
    },
    {
        image: "t8.jpeg",
        title: "Студенттер күніне орай көшбасшылардың бас қосуы",
        description: `Студенттер күніне орай Түркияның әр қаласында білім алып жүрген қазақ студенттерінің көшбасшылары Ыстанбұлда бас қосты.
Бұл ерекше кездесудің басты мақсаты — жастар арасындағы бірлікті нығайту, жаңа жобалармен бөлісу және студенттік ұйымдар арасындағы ынтымақтастықты арттыру.Бұл басқосу — алдағы бастамаларға серпін беретін, студенттердің рухын көтерген маңызды әрі мазмұнды жиын болды.`,
        date: '17.11.2024'
    },
    {
        image: "t9.jpeg",
        title: "Республика күніне орай құттықтау",
        description: `Құрметті отандастар!
Тәуелсіз еліміздің маңызды мерекелерінің бірі — Қазақстан Республикасының күнімен шын жүректен құттықтаймыз!
Бұл — мемлекеттігіміздің нығайып, демократиялық құндылықтардың орныққанын білдіретін тарихи күн.
Шетелде білім алып жатқан қазақ жастары ретінде, біз ел болашағы үшін жауапты екенімізді сезіне отырып, туған жеріміздің дамуы мен өркендеуіне өз үлесімізді қосуға әрдайым дайынбыз.`,
        date: '25.10.2024'
    },
    {
        image: "t9.jpeg",
        title: "Республика күніне орай құттықтау",
        description: `Құрметті отандастар!
Тәуелсіз еліміздің маңызды мерекелерінің бірі — Қазақстан Республикасының күнімен шын жүректен құттықтаймыз!
Бұл — мемлекеттігіміздің нығайып, демократиялық құндылықтардың орныққанын білдіретін тарихи күн.
Шетелде білім алып жатқан қазақ жастары ретінде, біз ел болашағы үшін жауапты екенімізді сезіне отырып, туған жеріміздің дамуы мен өркендеуіне өз үлесімізді қосуға әрдайым дайынбыз.`,
        date: '25.10.2024'
    },
    {
        image: "t10.jpeg",
        title: "Ыстанбұл қаласындағы қазақ студенттері",
        description: `Түркия, Ыстанбұл қаласындағы қазақ студенттерінің қатысуымен алғашқы театр қойылымы сәтті өткізілді! Шара 16 желтоқсан – Қазақстан Республикасының Тәуелсіздік күніне арналды.
Бұл қойылым тек мәдени шара ғана емес, сонымен қатар елге деген сүйіспеншілік пен ұлт рухын паш еткен ерекше бастама болды. Студенттердің таланты мен өнерге деген ықыласы көрермендерге ерекше әсер сыйлады.`,
        date: '16.12.2024'
    },
    {
        image: "t11.jpeg",
        title: "Birlik Baursaq Party ",
        description: `Ыстанбұлда қазақ халқының дәстүрлі тағамы — бауырсақ кеңінен таныстырылды. Шара аясында университет студенттері, әсіресе қыздар қауымы арасында бауырсақ пісіруден сайыс ұйымдастырылып, ұлттық дәм мен мәдениетті дәріптейтін керемет атмосфера қалыптасты. Бұл кеш — тек дәм мен дәстүр емес, бірлікті, жылылықты сезінудің тамаша үлгісі болды.`,
        date: '08.12.2024'
    },
]

const projectsVideo = [
    {
        video: "t1.mp4",
        title: "«Arbella Super Cup 2024» іріктеу матчтары және «TenizFest»",
        description: `“Бірлік” қазақ студенттер бірлестігі мен Қазақстанның Ыстанбұлдағы Бас консулдығының қолдауымен Түркияда білім алып жатқан қазақ студенттерінің қатысуымен екі маңызды шара жоғары деңгейде өткізілді.
Оның бірі — футболдан “Arbella Super Cup 2024” турнирінің іріктеу матчтары болса, екіншісі — жастардың достығы мен бірлігін арттырған көңілді әрі мазмұнды демалыс күні – “TenizFest” мәдени-спорттық шарасы.`,
        date: '07.10.2024'
    },
    {
        video: "t2.mp4",
        title: "Birlik Film— 31.05.2024",
        description: `📍 Халич Университеті
Ыстанбұлда оқитын қазақ жастары бір шаңырақ астында жиналып, ұлттық кинотуындыны бірге тамашалады. Бұл кеш — туған елдің рухын шетелде де ұлықтап, мәдениетімізге деген махаббатты арттыра түскен әсерлі сәттердің бірі болды.`,
        date: '31.05.2024'
    },
    {
        video: "t3.mp4",
        title: "Республика күніне орай құттықтау",
        description: `Құрметті отандастар!
Тәуелсіз еліміздің маңызды мерекелерінің бірі — Қазақстан Республикасының күнімен шын жүректен құттықтаймыз!
Бұл — мемлекеттігіміздің нығайып, демократиялық құндылықтардың орныққанын білдіретін тарихи күн.
Шетелде білім алып жатқан қазақ жастары ретінде, біз ел болашағы үшін жауапты екенімізді сезіне отырып, туған жеріміздің дамуы мен өркендеуіне өз үлесімізді қосуға әрдайым дайынбыз.`,
        date: '25.10.2024'
    },
    {
        video: "t4.mp4",
        title: "Студенттер күніне орай көшбасшылардың бас қосуы",
        description: `Студенттер күніне орай Түркияның әр қаласында білім алып жүрген қазақ студенттерінің көшбасшылары Ыстанбұлда бас қосты.
Бұл ерекше кездесудің басты мақсаты — жастар арасындағы бірлікті нығайту, жаңа жобалармен бөлісу және студенттік ұйымдар арасындағы ынтымақтастықты арттыру.Бұл басқосу — алдағы бастамаларға серпін беретін, студенттердің рухын көтерген маңызды әрі мазмұнды жиын болды.`,
        date: '17.11.2024'
    },
    {
        video: "t5.mp4",
        title: "Түркиядағы Қазақстандық студенттері ",
        description: `Түркиядағы Қазақстандық студенттері арасында ұйымдастырылған «Arbella Super Cup 2024» футбол турнирі өз мәресіне жетті. Финалдық ойындар жоғары деңгейде өтті. Түркие елінің түкпір-түкпірінен жиналған 16 команда бұл турнирде өнер көрсетіп, спорт арқылы бірлік пен достықты дәріптеді.`,
        date: '24.11.2024'
    },
    {
        video: "t6.mp4",
        title: "Birlik Baursaq Party ",
        description: `Ыстанбұлда қазақ халқының дәстүрлі тағамы — бауырсақ кеңінен таныстырылды. Шара аясында университет студенттері, әсіресе қыздар қауымы арасында бауырсақ пісіруден сайыс ұйымдастырылып, ұлттық дәм мен мәдениетті дәріптейтін керемет атмосфера қалыптасты. Бұл кеш — тек дәм мен дәстүр емес, бірлікті, жылылықты сезінудің тамаша үлгісі болды.`,
        date: '08.12.2024'
    },
    {
        video: "t7.mp4",
        title: "Ыстанбұл қаласындағы қазақ студенттері",
        description: `Түркия, Ыстанбұл қаласындағы қазақ студенттерінің қатысуымен алғашқы театр қойылымы сәтті өткізілді! Шара 16 желтоқсан – Қазақстан Республикасының Тәуелсіздік күніне арналды.
Бұл қойылым тек мәдени шара ғана емес, сонымен қатар елге деген сүйіспеншілік пен ұлт рухын паш еткен ерекше бастама болды. Студенттердің таланты мен өнерге деген ықыласы көрермендерге ерекше әсер сыйлады.`,
        date: '16.12.2024'
    },
]

const TopGrid = () => {
    return (
        <div className='max-w-11/12 mx-auto'>
            <div className="px-4 py-8 grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-6">
                {projects.map((project, index) => (
                    <Card
                        key={index}
                        image={project.image}
                        title={project.title}
                        description={project.description}
                        date={project.date}
                    />
                ))}
            </div>
            <div className='w-100% bg-gray-300 h-[1px]'></div>
        </div>
    )
}

export const TopGridVideo = () => {
    return (
        <div className='max-w-11/12 mx-auto'>
            <div className="px-4 py-8 grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-2 gap-6">
                {projectsVideo.map((project, index) => (
                    <CardVideo
                        key={index}
                        video={project.video}
                        title={project.title}
                        description={project.description}
                        date={project.date}
                    />
                ))}
            </div>
            <div className='w-100% bg-gray-300 h-[1px]'></div>
        </div>
    )
}

export default TopGrid
