{
    "title": "BIRLIK жайында",
    "subtitle": "Бірлік қазақ студенттер бірлестігі — Түркия Республикасында білім алып жатқан қазақ студенттеріне жан-жақты қолдау көрсету мақсатында құрылған волонтерлік жастар ұйымы",
    "desc": "Ұйымның басты мақсаты — студенттердің жаңа ортаға тез бейімделуіне, түрлі әлеуметтік, тұрмыстық және оқу барысындағы қиындықтарды жеңуіне көмектесу, сондай-ақ олардың жеке тұлға ретінде дамуына қолдау көрсету. «Бірлік» — жай ғана студенттік ұйым емес, бұл — шетелдегі өміріңіздің жаңа кезеңінде сенімді серігіңіз. Біз әрбір студенттің өзін жалғыз сезінбеуін, қазақ жастарының Түркиядағы бірлігінің нығаюын, сондай-ақ білім мен мәдениетті үйлестіре отырып, жан-жақты дамуына үлес қосатын ұйымбыз.",
    "help": {
        "title1": "Студенттерге қолдау",
        "desc2": "«Бірлік» ұйымы студенттерге күнделікті тұрмыстық және құқықтық мәселелерді шешуге көмектеседі. Сонымен қатар, Түркия университеттеріндегі оқу жүйесі мен әкімшілік рәсімдер бойынша нақты әрі пайдалы кеңес береді. Жаңа ортаға бейімделу, тұратын жер табу секілді маңызды мәселелерде де жан-жақты қолдау көрсетіледі.",
        "title2": "Білім беру бастамалары",
        "desc3": "Біз студенттердің жеке және кәсіби дағдыларын дамытуға бағытталған тренингтер, шеберлік сыныптары мен танымдық дәрістер ұйымдастырамыз. Себебі біз білім мен тәжірибе — әрбір жастың табысқа жету жолындағы басты құрал деп сенеміз.",
        "title3": "Мәдени іс-шаралар",
        "desc4": "Біз Қазақстанның ұлттық дәстүрлері мен мәдениетін таныстыратын, сонымен қатар Түркияның мәдениетімен жақынырақ танысуға мүмкіндік беретін түрлі мәдени іс-шаралар өткіземіз. Бұл бастамалар мәдениетаралық түсіністікті арттырып, студенттер арасындағы рухани байланыстарды нығайтады."
    },
    "mission": {
        "title": "Біздің миссиямыз",
        "desc1": "«Бірлік» ұйымының басты миссиясы — шетелде білім алып жүрген қазақ жастарына жан-жақты қолдау көрсету. Біз студенттердің жаңа ортаға тез бейімделуіне, білім мен тәжірибені үйлестіре отырып дамуына, және ұлттық болмысын сақтай отырып өркениетті әлемде өз орнын табуына ықпал етеміз.",
        "desc2": "Біз әрбір жастың жалғыз еместігін сезінуін, ортақ құндылықтар мен достыққа негізделген ортада өсіп-дамуын қалаймыз. Білім, мәдениет және бірлік — біздің басты бағдарымыз."
    },
    "teamCards": {
        "title1": "Студенттерге көмек",
        "description1": "Біз тұрмыстық және құқықтық мәселелерді шешуге көмектесеміз, Түркия университеттеріндегі оқу және әкімшілік процестер бойынша кеңестер береміз, сондай-ақ баспана және жаңа ортаға бейімделуге көмек көрсетеміз.",
        "title2": "Білім беру бастамалары",
        "description2": "Біз студенттердің жеке және кәсіби дағдыларын дамытуға арналған тренингтер, мастер-класстар мен лекциялар өткізуді ұйымдастырамыз. Біз білім мен тәжірибе табысқа жетудің кілті екеніне сенеміз.",
        "title3": "Мәдени шаралар",
        "description3": "Біз студенттерге Қазақстанның дәстүрлері мен мәдениеті туралы танысуға, сондай-ақ Түркия мәдениетін үйренуге мүмкіндік беретін мәдени шараларды ұйымдастырамыз, олар арасында мәдени байланыстар орнатылады."
    },
    "blog": {
        "text1": "Әрбір студенттің бойында ерекше идея мен әлеует бар. Біз сол идеялардың жүзеге асуына қолдау көрсетеміз. Егер сіздің өз жобаларыңыз, бастамаларыңыз, шығармашылық немесе әлеуметтік идеяларыңыз болса — «Бірлік» сіздің серіктесіңіз. Ұйым шеңберінде студенттер өз жобаларын таныстырып, қолдау мен кеңес алып, тәжірибелі мамандардың бағыт-бағдарын ескере отырып жүзеге асыра алады. Бұл — жобаңызға жан бітіру мүмкіндігі ғана емес, сонымен қатар нағыз өмірлік тәжірибе алаңы.",
        "text2": "Біз үшін білім — тек университет қабырғасымен шектелмейтін, өмір бойы даму жолы. Сондықтан біз студенттердің интеллектуалдық, кәсіби және тұлғалық дамуына арналған түрлі білім беру бастамаларын жүзеге асырамыз. Шеберлік сабақтары, тренингтер, ашық лекциялар мен пікірталастар арқылы жастардың заманауи дағдыларды меңгеріп, болашаққа сенімді қадам жасауына жағдай жасаймыз. Көшбасшылық, коммуникация, уақытты басқару, кәсіпкерлік сияқты өзекті тақырыптарда жиі кездесулер өткіземіз.",
        "text3": "Технологияда алғашқы болғыңыз келе жатқан тәжірибелі дамытушы, жаңа технологияларды оқып жатқан студент немесе соңғы технологиялық шешімдерге қажет болатын бизнес болс үшін, BIRLIK сізді сәтті болуға көмек көрсету үшін осында.",
        "title1": "Жеке жобаларды қолдау",
        "title2": "Білім беру бастамалары және мастер-класстар",
        "blog": "Блог посттары"
    },
    "team": {
        "meet": "Біздің Көшбасшыларымызбен танысыңыз !",
        "desc": "Біз студенттерге жаңа ортада бейімделуге, туындайтын мәселелерді шешуге және жеке дамуы мен кәсіби өсуіне мүмкіндік жасауға көмектесуді мақсат етеміз. Біздің ұйым өзара көмек, бірлік және қазақ мәдениетіне деген құрмет принциптеріне негізделген. Біз басқа елде қолдау алудың, әсіресе бейімделу қиындықтарына, тілдік кедергілерге және басқа да сынақтарға тап болған студенттер үшін қаншалықты маңызды екенін түсінеміз. Біз әрбір студент өзін қауіпсіз сезініп, дамуы үшін қоғамдастық құрудамыз.",
        "viewall": "Барлығын көру"
    },
    "map": {
        "title": "Бірлік ұйымы жеті жылдан бері Түркияда білім алып жатқан қазақ студенттеріне тұрақты түрде қолдау көрсетіп, рухани және кәсіби дамуына үлес қосып келеді.",
        "subtitle": "Бұл жылдар ішінде біз бірлік пен бауырмалдықтың берік көпіріне айналдық."
    }
}
