{
    "title": "Біз туралы",
    "subtitle": "Birlik Qazaq Jastary — Түркияда оқитын қазақ студенттеріне қолдау көрсету мақсатында құрылған волонтерлік ұйым.",
    "desc": "Біз студенттерге жаңа ортада бейімделуге, туындайтын мәселелерді шешуге және жеке дамуы мен кәсіби өсуіне мүмкіндік жасауға көмектесуді мақсат етеміз. Біздің ұйым өзара көмек, бірлік және қазақ мәдениетіне деген құрмет принциптеріне негізделген. Біз басқа елде қолдау алудың, әсіресе бейімделу қиындықтарына, тілдік кедергілерге және басқа да сынақтарға тап болған студенттер үшін қаншалықты маңызды екенін түсінеміз. Біз әрбір студент өзін қауіпсіз сезініп, дамуы үшін қоғамдастық құрудамыз.",
    "help": {
        "title1": "Студенттерге қолдау",
        "desc2": "Біз студенттерге тұрмыстық және заңдық мәселелерді шешуде, түрік университеттеріндегі оқу және әкімшілік процестер бойынша кеңес беруде, тұратын жер табуға және жаңа ортаға бейімделуге көмектесеміз.",
        "title2": "Білім беру бастамалары",
        "desc3": "Біз студенттердің жеке және кәсіби дағдыларын дамытуға бағытталған тренингтер, шеберлік сыныптары мен лекциялар ұйымдастырамыз. Біз білім мен тәжірибе табыстың кілті екенін сенеміз.",
        "title3": "Мәдени іс-шаралар",
        "desc4": "Біз студенттерге Қазақстанның дәстүрлері мен мәдениетімен танысуға, сондай-ақ Түркияның мәдениетімен танысуға мүмкіндік беретін мәдени шаралар ұйымдастырамыз, бұл арқылы мәдениетаралық байланыстар орнатамыз."
    },
    "mission": {
        "title": "Біздің миссиямыз",
        "desc1": "Студенттерге жаңа ортада бейімделуге, туындайтын мәселелерді шешуге және жеке дамуы мен кәсіби өсуіне мүмкіндік беру.",
        "desc2": "Түркиядағы қазақ студенттер арасында күшті байланыстарды құру, оларды бейімделу процесінде қолдау көрсету және олардың өмірін жақсарту үшін білімдік, мәдени, және әлеуметтік мүмкіндіктерді ұсыну. Біз бірлік күшіне сенімдік береміз және студенттердің потенциалын ашуға және өзінің мамандары болуға көмек көрсететін көркем күлік, білімдік және әлеуметтік жобаларды дамытуға тырысамыз."
    },
    "teamCards": {
        "title1": "Студенттерге көмек",
        "description1": "Біз тұрмыстық және құқықтық мәселелерді шешуге көмектесеміз, Түркия университеттеріндегі оқу және әкімшілік процестер бойынша кеңестер береміз, сондай-ақ баспана және жаңа ортаға бейімделуге көмек көрсетеміз.",
        "title2": "Білім беру бастамалары",
        "description2": "Біз студенттердің жеке және кәсіби дағдыларын дамытуға арналған тренингтер, мастер-класстар мен лекциялар өткізуді ұйымдастырамыз. Біз білім мен тәжірибе табысқа жетудің кілті екеніне сенеміз.",
        "title3": "Мәдени шаралар",
        "description3": "Біз студенттерге Қазақстанның дәстүрлері мен мәдениеті туралы танысуға, сондай-ақ Түркия мәдениетін үйренуге мүмкіндік беретін мәдени шараларды ұйымдастырамыз, олар арасында мәдени байланыстар орнатылады."
    },
    "blog": {
        "text1": "BIRLIK-те біз технологиялар мен қосымша біріктіргіштерді жеке және ұйымдарды құдыраттыластыру үшін жасалған қауымдықты қалыптастыруға арналғанымыз. Біздің миссиямыз, дамып жатқан технологиялар әлемінде қалыптасушыларға, студенттерге және бизнеске бүгінгі технологиялар әлемінде сәтті болу үшін қажетті құралдар, ресурстар мен қолдауны ұсыну.",
        "text2": "Біз білім босығын толтыру, инновацияны ұсыну және жалпы оқуға үлесін қалыптауға бағытталған платформа жасауға ниеттеміз.",
        "text3": "Технологияда алғашқы болғыңыз келе жатқан тәжірибелі дамытушы, жаңа технологияларды оқып жатқан студент немесе соңғы технологиялық шешімдерге қажет болатын бизнес болс үшін, BIRLIK сізді сәтті болуға көмек көрсету үшін осында.",
        "title1": "Студенттерге қолдау және менторлық",
        "title2": "Білім беру бастамалары және мастер-класстар",
        "blog": "Блог посттары"
    },
    "team": {
        "meet": "Біздің профессионалдарымызмен танысыңыз",
        "desc": "Біз студенттерге жаңа ортада бейімделуге, туындайтын мәселелерді шешуге және жеке дамуы мен кәсіби өсуіне мүмкіндік жасауға көмектесуді мақсат етеміз. Біздің ұйым өзара көмек, бірлік және қазақ мәдениетіне деген құрмет принциптеріне негізделген. Біз басқа елде қолдау алудың, әсіресе бейімделу қиындықтарына, тілдік кедергілерге және басқа да сынақтарға тап болған студенттер үшін қаншалықты маңызды екенін түсінеміз. Біз әрбір студент өзін қауіпсіз сезініп, дамуы үшін қоғамдастық құрудамыз.",
        "viewall": "Барлығын көру"
    },
    "map": {
        "title": "10 жылдан астам жылдардан бері біз қызмет көрсетеміз",
        "subtitle": "Birlik Qazaq Jastary — Түркияда оқитын қазақ студенттеріне қолдау көрсету мақсатында құрылған волонтерлік ұйым."
    }
}